{
  "name": "All Line Rail Rover",
  "url": "http://www.railrover.org/pages/all-line.html",
  "description": "ALL LINE RAIL ROVER The All Line Rover is the \"daddy of them all\" and covers the whole network (mostly). \n      It is available for either 7 or 14 consecutive days and is the only rail rover offering both standard and first class options. Except for the restrictions listed below it is valid at anytime and on all the trains of the Train Operating Companies listed. Both 7 and 14 day All Line Rovers can be purchased Online Time Restrictions (not applicable to weekends and public holidays): NOT VALID for boarding or alighting before 10.00 Mondays to Fridays any service operated by: Avanti West Coast Cross Country East Midlands Railway London North Eastern Railway at the following stations: Birmingham New Street Bedford London Euston London King's Cross Luton Luton Airport Parkway Milton Keynes Central St.Pancras International Stevenage Watford Junction TOC Restrictions : Rather than highlight where you can go it is simpler to state where you cannot go - it is NOT VALID on the following: Eurostar / Heathrow Express / London Underground / Docklands Light Railway / local metro tram systems / shipping services / any of the private railways except for the \n      Ffestiniog Railway & Welsh Highland Railway (3rd class) for which advance booking is currently required. It is valid on both the CALEDONIAN SLEEPER and Great Western sleeper - in the seated sections a reservation is compulsory on the Caledonian and advisory on the Great Western. If you travel in a SLEEPER BERTH you must pay \n      the appropriate additional supplement.  The ALR must be valid on the date of arrival of the sleeper service but not necessarily on the date of departure. Tickets purchased with the Two-Together railcard remain valid on sleeper services to the destination if boarded before 04:30. The first class ticket allows access to any complimentary offers that you would be entitled to with an ordinary first class ticket, such as drinks, \n      meals and access to 1st class lounges, all in the price. The All Line Rail Rover is valid for travel until 04:29 of the morning immediately following the expiry \n      date shown on the ticket (excluding sleepers - see above). If you experience a delay whilst using an ALR you may be able to claim compensation, see here The All Line Rover has restriction code AL Found an error on this page? Let us know and we'll fix it Page updated March 2025    \n      Copyright © 2025 RailRover.org",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 standard class 7 day adult: £625.00 child (5-15): £312.50 16-17 saver: £312.50 railcards ⯆ 16 26 SE DI 2T FF H V £416.25 FF H V child fare: £118.75 standard class 14 day adult: £949.00 child (5-15): £474.50 16-17 saver: £474.50 railcards ⯆ 16 26 SE DI 2T FF H V £632.05 FF H V child fare: £180.30 1st class 7 day adult: £949.00 child (5-15): £474.50 railcards ⯆ SE DI 2T H V £632.05 H V child fare: £180.30 1st class 14 day adult: £1450.00 child (5-15): £725.00 railcards ⯆ SE DI 2T H V £965.70 H V child fare: £275.50 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together H = HM Forces V = Veterans Previous fares ⯈ Previous fares (adult 7 day standard): 2024 - £598 2023 - £571 2022 - £540 2021 - £540 2020 - £540 2019 - £526 2018 - £510 2014 - £478 2012 - £450 2011 - £430 (adult 14 day 1st): 2024 - £1387 2023 - £1323 2022 - £1250 2021 - £1250 2020 - £1250 2019 - £1216 2018 - £1179 2014 - £1106 2012 - £1040 2011 - £990 time restrictions See \"restrictions\" opposite. Note that 2T railcard not valid before 09:30 No restrictions at weekends or bank holidays train operating companies Avanti West Coast, c2c, Caledonian Sleeper, Chiltern Railways, CrossCountry, East Midlands Railway, Elizabeth Line, Gatwick Express, Grand Central, Great Northern,  Great Western Railway, \n      Greater Anglia, Hull Trains, Island Line, London North Eastern Railway, London Northwestern Railway, London Overground, Lumo, Merseyrail, Northern, ScotRail, South Western Railway, \n      Southeastern, Southern, Stansted Express, Thameslink, TransPennine Express, Transport for Wales, West Midlands Railway purchasing Buy Online : ✔ Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [],
  "route_map_images": []
}