{
  "name": "Cumbrian Coast Day Ranger (Carlisle-Barrow in Furness)",
  "url": "http://www.railrover.org/pages/cumbrian-coast-day-ranger.html",
  "description": "CUMBRIAN COAST DAY RANGER Unlimited travel for one day between Carlisle and Barrow in Furness along the Cumbrian coast. Alighting at Ravenglass you can visit the Ravenglass & Eskdale Railway and obtain a 10% discount off single and return fares.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult: £26.40 child (5-15): £13.20 16-17 saver: £13.20 railcards ⯆ 16 26 SE DI 2T FF H V : £17.55 FF H V child fare: £5.00 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together FF = Family & Friends H = HM Forces V = Veterans Previous fares ⯈ Previous fares (adult): 2024 - £25.20 2023 - £24.10 2022 - £22.70 2021 - £21.40 2020 - £21.40 2019 - £20.80 2018 - £20.20 2014 - £19.00 2011 - £17.00 time restrictions Valid anytime but 2T railcard not valid until 09:30 train operating companies Northern purchasing Online: X Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities This ticket is valid at these national network stations: Askam; Aspatria Barrow-in-Furness; Bootle; Braystones Carlisle; Corkickle Dalston; Drigg Flimby; Foxfield Green Road Harrington Kirkby-in-Furness Maryport; Millom Nethertown Parton Ravenglass for Eskdale Seascale; Sellafield; Silecroft; St Bees Whitehaven; Wigton; Workington Found an error on this page? Let us know and we'll fix it Page updated March 2025    \n      Copyright © 2025 RailRover.org"
  },
  "stations": [],
  "route_map_images": [
    "ticket_maps/Cumbrian_Coast_Day_Ranger_Carlisle-Barrow_in_Furness_cumbrian_coast_day_ranger.gif"
  ]
}