{
  "name": "Derbyshire Wayfarer (day ranger)",
  "url": "http://www.railrover.org/pages/derbyshire-wayfarer.html",
  "description": "DERBYSHIRE WAYFARER Unlimited travel for one day with weekday time restrictions on all trains within Derbyshire including Shirebrook to Whitwell and outside the county to Sheffield, Burton-on-Trent and \n      Uttoxeter. It is also valid on the majority of bus services within Derbyshire and to a limited number of destinations outside the county. Details can be found on the \n      Derbyshire CC website (link below). Shirebrook and Whitwell are isolated by rail from the rest and connected only by bus as is New Mills Newton and New Mills Central which are connected either by bus or by walking \n      between the two. A separate ticket is also available from Nottingham and Beeston which includes rail travel from those stations to either Long Eaton or Ilkeston. The ticket is issued as a scratchcard where you have to \"scratch off\" the month and day of travel. A separate ticket is also available from Nottingham and Beeston which includes rail travel from those stations to either \n      Long Eaton or Ilkeston. The ticket also gives discounts at various attractions in Derbyshire.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult: £17.00 child (5-15): £8.50 group#: £34.00 Senior Railcard: £11.30 GC/encts*: £11.30 From Nottingham & Beeston: adult: £23.40 child (5-15): £11.70 Senior Railcard: £15.60 GC/encts*: £11.30 #Group tickets are for up to 2 adults and up to 3 children *This fare applies to holders of a Gold Card or other English National Concessionary Travel Scheme (ENCTS) pass Previous fares ⯈ Previous fares (adult): 2024 - £16.00 2023 - £15.40 2022 - £13.40 2021 - £13.40 2020 - £13.40 2019 - £13.40 2018 - £12.60 2014 - £12.00 2011 - £10.50 time restrictions Mon to Fri: valid after 09:00 No restrictions at weekends, public holidays or on buses route restrictions Not valid to Nottingham Not valid to Worksop Not valid to East Mids Parkway Not valid west of New Mills train operating companies CrossCountry, East Midlands Railway, Northern, TransPennine Express purchasing Online: X Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands Bus driver: ✔ Train conductor: ✔ Order by telephone: X Other outlets: ✔ see website * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Alfreton",
    "Ambergate Bamford",
    "Belper",
    "Burton-on-Trent",
    "Buxton Chapel-en-le-Frith",
    "Chesterfield",
    "Chinley",
    "Creswell",
    "Cromford Derby",
    "Dore & Totley",
    "Dove Holes",
    "Dronfield",
    "Duffield Edale Furness Vale Grindleford Hathersage",
    "Hope Ilkeston Langley Mill",
    "Langwith-Whaley Thorns",
    "Long Eaton Matlock",
    "Matlock Bath New Mills Central",
    "New Mills Newtown Peartree Sheffield",
    "Shirebrook",
    "Spondon Tutbury & Hatton Uttoxeter Whaley Bridge",
    "Whatstandwell",
    "Whitwell",
    "Willington"
  ],
  "route_map_images": [
    "ticket_maps/Derbyshire_Wayfarer_day_ranger_derbyshire_wayfarer.gif"
  ]
}