{
  "name": "East Suffolk Day Ranger (Ipswich-Lowestoft/Felixstowe)",
  "url": "http://www.railrover.org/pages/east-suffolk-day-ranger.html",
  "description": "EAST SUFFOLK DAY RANGER Unlimited travel with weekday time restrictionsf or one day between Ipswich and Felixstowe and along the East Suffolk line to Lowestoft.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult: £24.90 child (5-15): £12.45 16-17 saver: £12.45 family*: £49.80 senior#: £16.55 railcards ⯆ 16 26 DI 2T FF H V : £16.55 FF H child fare: £2.00 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together FF = Family & Friends H = HM Forces V = Veterans Previous fares ⯈ Previous fares (adult): 2024 - £23.80 2023 - £22.20 2022 - £21.00 2021 - £20.00 2020 - £20.00 2019 - £20.00 *Family tickets (no railcard required) are for up to two adults and up to two children #Senior tickets (no railcard required) apply to anyone over the age of 60 and up to four children can travel at £2 each time restrictions Mon to Fri: valid from 08:45 but 2T railcard not valid until 09:30 No restrictions at weekends or bank holidays Also valid on the 08:15 Saxmundham-Ipswich train operating companies Greater Anglia purchasing Online: X Train conductor: ✔ * Bus driver: X Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Beccles Brampton Darsham",
    "Derby Road Felixstowe Halesworth Ipswich Lowestoft Melton Oulton Broad South Saxmundham Westerfield",
    "Wickham Market",
    "Woodbridge Trimley"
  ],
  "route_map_images": [
    "ticket_maps/East_Suffolk_Day_Ranger_Ipswich-LowestoftFelixstowe_east_suffolk_day_ranger.gif"
  ]
}