{
  "name": "Explore West Wales (west of Carmarthen day ranger)",
  "url": "http://www.railrover.org/pages/explore-west-wales.html",
  "description": "EXPLORE WEST WALES Unlimited travel for one day with weekday time restrictions along the lines west from Carmarthen in west Wales to Tenby, Pembroke, Haverfordwest, Milford Haven and \n      Fishguard Harbour. Buy this ticket online from the TfW website",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult: £12.50 child (5-15): £6.25 16-17 saver: £6.25 railcards ⯆ 16 26 SE DI 2T H V : £8.30 H V child fare: £2.50 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together H = HM Forces V = Veterans Previous fares ⯈ Previous fares (adult): 2024 - £12.00 2023 - £14.00 2022 - £13.50 2021 - £13.50 2020 - £13.50 2019 - £13.00 2018 - £13.00 2014 - £10.20 2011 - £8.80 time restrictions Mon to Fri: valid from 09:30 No restrictions at weekends or bank holidays train operating companies Transport for Wales purchasing Online from TfW website ✔ Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Carmarthen",
    "Clarbeston Road",
    "Clunderwen Fishguard & Goodwick",
    "Fishguard Harbour Haverfordwest Johnston Kilgetty Lamphey Manorbier",
    "Milford Haven Narberth Pembroke",
    "Pembroke Dock",
    "Penally Saundersfoot Tenby Whitland"
  ],
  "route_map_images": [
    "ticket_maps/Explore_West_Wales_west_of_Carmarthen_day_ranger_explore_west_wales.gif"
  ]
}