{
  "name": "Explore Cambrian Coast Day Ranger",
  "url": "http://www.railrover.org/pages/explore-cambrian-coast-day-ranger.html",
  "description": "EXPLORE CAMBRIAN COAST DAY RANGER Unlimited travel for one day with weekday time restrictions on the lines from Machynlleth to Aberystwyth and from Machynlleth to Pwllheli. It allows you to visit four of the Welsh narrow gauge railways: the Vale of Rheidol Railway at Aberystwyth, the Talyllyn Railway at Tywyn, the Fairbourne Railway near Barmouth and \n      the Ffestiniog Railway at Minffordd. Buy this ticket online from the TfW website",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult: £19.00 child (5-15): £9.50 16-17 saver: £9.50 family*: £26.00 railcards ⯆ 16 26 SE DI 2T H V : £12.65 H V child fare: £3.80 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together H = HM Forces V = Veterans *Family tickets are for up to 2 adults and up to 2 children Previous fares ⯈ Previous fares (adult): 2024 - £18.00 2023 - £14.00 2022 - £13.50 2021 - £13.50 2020 - £13.50 2019 - £13.00 2018 - £13.00 2014 - £11.10 2013 - £9.80 time restrictions Mon to Fri: valid from 09:30 No restrictions at weekends or bank holidays train operating companies Transport for Wales purchasing Online from TfW website ✔ Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Aberdovey",
    "Abererch",
    "Aberystwyth",
    "Ardudwy Barmouth",
    "Borth",
    "Bow Street Criccieth Dovey Junction",
    "Dyffryn Fairbourne Harlech Llanaber",
    "Llanbedr",
    "Llandanwg",
    "Llandecwyn",
    "Llwyngwril Machynlleth",
    "Morfa Mawddach",
    "Minffordd Penhelig",
    "Penrhyndeudraeth",
    "Pensarn",
    "Penychain",
    "Porthmadog",
    "Pwllheli Talsarnau",
    "Talybont",
    "Tonfanau",
    "Tygwyn",
    "Tywyn"
  ],
  "route_map_images": [
    "ticket_maps/Explore_Cambrian_Coast_Day_Ranger_explore_cambrian_coast_day_ranger.gif"
  ]
}