{
  "name": "Explore The Capital Day Ranger (Cardiff area)",
  "url": "http://www.railrover.org/pages/explore-the-capital-day-ranger.html",
  "description": "EXPLORE THE CAPITAL DAY RANGER Unlimited travel for one day with weekday time restrictions on Transport for Wales services in and around the Cardiff area on the lines to Coryton, Radyr, Cardiff Bay, Eastbrook, \n      Penarth and Llanishen. Journeys started up to and including 15:59 can be completed even if a change of train is required.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 8th June 2025 One day ranger adult: £7.50 child (5-15): £3.75 16-17 saver: £3.75 railcards ⯆ 16 26 SE DI 2T H V : £4.95 V child fare: £1.50 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together HM = H Forces V = Veterans Previous fares ⯈ Previous fares (adult): 2024 - £5.00 2023 - £4.80 2022 - £4.60 2021 - £4.60 2020 - £4.60 2019 - £4.50 2018 - £4.50 time restrictions Mon to Fri: valid after 09:30 but not valid between 16:00 and 18.30 inclusive No restrictions at weekends and bank holidays train operating companies Transport for Wales purchasing Online: X Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities Be aware that Transport for Wales have implemented \"Pay As You Go\" tap in/tap out with reduced fares and a daily price cap (a weekly cap is also available). This has resulted in the maximum daily fare in the Explore the Capital Day Ranger area being less than the price of the ranger. There are no time restrictions and validity extends to Newport on Cross Country trains (not GWR). Find out more here ."
  },
  "stations": [
    "Birchgrove Cardiff Bay",
    "Cardiff Central",
    "Cardiff Queen Street",
    "Cathays",
    "Cogan",
    "Coryton Danescourt",
    "Dingle Road Eastbrook Fairwater Grangetown Heath High Level",
    "Heath Low Level Llandaf",
    "Llanisien Ninian Park Penarth Radyr",
    "Rhiwbina Ty Glas Waun-Gron Park",
    "Whitchurch"
  ],
  "route_map_images": [
    "ticket_maps/Explore_The_Capital_Day_Ranger_Cardiff_area_explore_the_capital.gif"
  ]
}