{
  "name": "Great West Way Discoverer Global 7 Day Pass (7 days)",
  "url": "http://www.railrover.org/pages/great-west-way-discoverer-global7day.html",
  "description": "GREAT WEST WAY DISCOVERER GLOBAL PASS Unlimited travel with weekday time restrictions for 7 consecutive days centred around the \n      Great West Way. Bus travel in the area is also included. The Great West Way® is a 125-mile touring route between London, \n      Bath and Bristol based on ancient routes. It allows travel between London Paddington and Bristol Temple Meads via Chippenham;\n      London Waterloo to Bristol Temple Meads via Salisbury and Westbury; Reading to Westbury via Pewsey; Westbury to Frome; Swindon to Westbury and the Thames Valley \n      branch lines to Windsor & Eton Central, Marlow and Henley-on-Thames. The following bus routes are also included: X2 and X32 between Oxford and Wantage â\u0080\u0093 Thames Travel, Connector service X38/X39 & X40, Reading, Henley, Wallingford, Oxford â\u0080\u0093 Thames Travel, River Rapids service. X5 Salisbury, Amersbury, Pewsey, Marlborough, Swindon â\u0080\u0093 Salisbury Reds service. Green Line services 702 and 703 between Heathrow, Windsor and LEGOLAND Windsor Resort. Reading Buses services excluding Greenwave, Kennections football and special event services. 49 Trans-Wilts-Express, Swindon, Trowbridge â\u0080\u0093 Stagecoach West service. 55 Swindon, Royal Wootton Bassett, Chippenham â\u0080\u0093 Stagecoach West GOLD service. S6 Swindon, Faringdon, Oxford â\u0080\u0093 Stagecoach West GOLD service. 80/81 Swindon â\u0080\u0093 Malborough â\u0080\u0093 Stagecoach West service. All First West of England services except the Bristol Flyer services.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 7 consecutive days adult: £299.00 child (5-15): £149.50 railcards ⯆ 16 26 SE DI 2T H FF : £269.10 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together H = HM Forces FF = Family & Friends Previous fares ⯈ Previous fares (adult): 2024 - £285.50 2023 - £272.00 2022 - £245.00 2021 - £239.00 2020 - £239.00 2019 - £239.00 time restrictions Mon to Fri: valid from 09:20 until midnight except for departures from Paddington between 16:40-19:16 inclusive No restrictions at weekends or bank holidays train operating companies Great Western Railway, South Western Railway purchasing Online at GWR : ✔ Online at SWR : ✔ Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Acton Main Line",
    "Aldermaston",
    "Andover",
    "Avoncliff Basingstoke",
    "Bath Spa",
    "Bedwyn",
    "Berrylands",
    "Bradford-on-Avon",
    "Bristol Temple Meads",
    "Brookwood",
    "Burnham",
    "Byfleet and New Haw Chippenham",
    "Cholsey",
    "Clapham Junction Didcot Parkway",
    "Dilton Marsh Ealing Broadway",
    "Esher Farnborough",
    "Fleet",
    "Freshford",
    "Frome Grateley",
    "Goring & Streatley Hanwell",
    "Hayes & Harlington",
    "Hersham",
    "Hook",
    "Hungerford Iver Keynsham",
    "Kintbury Langley",
    "London Paddington",
    "London Waterloo Maidenhead",
    "Melksham",
    "Midgham Newbury",
    "Newbury Racecourse",
    "New Malden Oldfield Park",
    "Overton Pangbourne",
    "Pewsey Queenstown Road Raynes Park",
    "Reading",
    "Reading West Salisbury",
    "Slough",
    "Southall",
    "Surbiton",
    "Swindon Taplow",
    "Thatcham",
    "Theale",
    "Tilehurst",
    "Trowbridge",
    "Twyford Vauxhall Walton-on-Thames",
    "Warminster",
    "Westbury",
    "West Byfleet",
    "West Drayton",
    "West Ealing",
    "Weybridge",
    "Whitchurch",
    "Wimbledon",
    "Winchfield",
    "Woking"
  ],
  "route_map_images": [
    "ticket_maps/Great_West_Way_Discoverer_Global_7_Day_Pass_7_days_great_west_way_global.gif"
  ]
}