{
  "name": "Highland Rover (4 in 8 days)",
  "url": "http://www.railrover.org/pages/highland-rover.html",
  "description": "HIGHLAND ROVER Unlimited travel with weekday time restrictions for Inverness and Aberdeen for any 4 days in 8 days. It includes the whole of the West Highland line from \n      Glasgow Queen Street to Oban, Fort William and Mallaig as well as all routes north of Inverness, east to Aberdeen and south to Aviemore. The Highland Rover is separated into two parts. One part allows travel between Glasgow, Oban, Fort William and Mallaig over the West Highland line. \n      The second part is between Inverness, Kyle of Lochalsh, Wick and Thurso on the Far North line and south of Inverness to Aberdeen and Aviemore. You cannot travel by rail between the two parts (as there is no northern connection) but you can by coach as the rover is also valid on Scottish CityLink and West Coast Motors between \n      Oban, Fort William and Inverness but be aware that bus services are not integrated with Scotrail train times so if your train is delayed the buses will not wait and you could be stranded. The rover is also valid on Stagecoach Highland buses between Thurso and Scrabster. A 20% discount is available on Northlink ferry services between Scrabster-Stromness; â\u0080\u008bAberdeen-Lerwick and Aberdeen-Kirkwall-Lerwick. A 10% discount is available on both the Strathspey Steam Railway and the Keith & Dufftown Railway standard class fares. A 10% discount is available on both the Strathspey Steam Railway and the Keith & Dufftown Railway standard class fares. This ticket is no longer valid on Caledonian-MacBrayne ferry services.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 1st April 2025 Any 4 days in 8 adult: £99.00 child (5-15): £49.50 railcards ⯆ 16 26 SE DI 2T FF : £65.30 FF child fare: £18.80 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together FF = Family & Friends Previous fares ⯈ Previous fares (adult): 2024 - £95.00 2023 - £95.00 2022 - £95.00 2021 - £95.00 2020 - £95.00 2019 - £89.00 2018 - £85.00 2014 - £81.50 2011 - £74.00 time restrictions Mon to Fri: not valid on trains timed to arrive at Aberdeen or Inverness before 09:00 otherwise valid anytime but 2T railcard not valid until 09:30 No restrictions at weekends or public holidays route restrictions Not valid on \"The Jacobite\" steam-hauled services between Fort William and Mallaig Not valid on London North Eastern Railway train operating companies ScotRail only purchasing Online as an M-pass to a smartphone: ✔ Train conductor: ✔ * Station ticket office: ✔ By telephone: ✔ 0344 811 0141 Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London Kings Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Aberdeen",
    "Achanalt",
    "Achnasheen",
    "Achnashellach",
    "Alness",
    "Altnabreac",
    "Anderston",
    "Anniesland",
    "Ardgay",
    "Ardlui",
    "Arisaig",
    "Arrochar & Tarbet",
    "Ashfield",
    "Attadale",
    "Aviemore Banavie",
    "Beasdale",
    "Beauly",
    "Bowling",
    "Bridge of Orchy",
    "Brora Cardross",
    "Carrbridge",
    "Clydebank",
    "Connel Ferry",
    "Conon Bridge",
    "Corpach",
    "Corrour",
    "Crianlarich",
    "Culrain Dalmally",
    "Dalmuir",
    "Dalreoch",
    "Dingwall",
    "Drumchapel",
    "Drumry",
    "Duirinish",
    "Dumbarton Central",
    "Dumbarton East",
    "Duncraig",
    "Dunrobin Castle",
    "Dyce Elgin",
    "Exhibition Centre Falls of Cruachan",
    "Fearn",
    "Forres",
    "Forsinard",
    "Fort William Garelochhead",
    "Garscadden",
    "Garve",
    "Georgemas Junction",
    "Gilshochill",
    "Glasgow Central",
    "Glasgow Queen Street",
    "Glenfinnan",
    "Golspie Helensburgh Helmsdale",
    "Upper",
    "Huntly",
    "Hyndland Insch",
    "Invergordon",
    "Inverness",
    "Invershin",
    "Inverurie Jordanhill Keith",
    "Kelvindale",
    "Kildonan",
    "Kilpatrick",
    "Kinbrace",
    "Kintore",
    "Kyle of Lochalsh Lairg",
    "Lochailort",
    "Loch Awe",
    "Loch Eil Outward Bound",
    "Locheilside",
    "Lochluichart Mallaig",
    "Maryhill",
    "Morar",
    "Muir of Ord Nairn Oban Partick",
    "Plockton",
    "Possilpark & Parkhouse Rannoch",
    "Rogart",
    "Roy Bridge Scotstounhill",
    "Singer",
    "Spean Bridge",
    "Strathcarron",
    "Stromeferry",
    "Summerston Tain",
    "Taynuilt",
    "Thurso",
    "Tulloch",
    "Tyndrum Lower Upper Tyndrum Westerton",
    "Wick Yoker"
  ],
  "route_map_images": [
    "ticket_maps/Highland_Rover_4_in_8_days_highland_rover.gif"
  ]
}