{
  "name": "Ride Cornwall (rail and bus day ranger)",
  "url": "http://www.railrover.org/pages/ride-cornwall.html",
  "description": "RIDE CORNWALL Unlimited travel for one day with weekday time restrictions throughout Cornwall as well as to/from Plymouth and includes the four branch lines in Cornwall to Looe, Newquay, \n      Falmouth and St.Ives plus the Gunnislake branch in Devon. You can visit the Bodmin & Wenford Railway at Bodmin Parkway and the Helston Railway by alighting at either Camborne, \n      Hayle or St.Erthand This is the same as the \"Cornwall Ranger\" but is also valid on all bus routes operated by \"First\" and \"CityBus/Go Cornwall\" and direct bus services between \n      Plymouth and Cornwall both ways.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions Fares correct 8th June 2025 One day ranger adult: £21.00 child (5-15): £10.50 family*: £42.00 railcards: no *Family tickets are for up to two adults and up to three children Previous fares ⯈ Previous fares (adult): 2024 - £18.00 2023 - £18.00 2022 - £18.00 2021 - £18.00 2020 - £18.00 2019 - £18.00 2018 - £13.00 2014 - £10.00 2011 - £10.00 time restrictions Mon to Fri: valid from 09:00 No restrictions at weekends or bank holidays Also valid on the following services: 08:09 Plymouth-Penzance 08:28 Plymouth-Gunnislake 08:16 Liskeard-Looe train operating companies CrossCountry, Great Western Railway, South Western Railway purchasing Online : ✔ Train conductor: ✔ * Bus driver: ✔ Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London Kings Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Bere Alston",
    "Bere Ferrers",
    "Bodmin Parkway",
    "Bugle Calstock",
    "Camborne",
    "Carbis Bay",
    "Causeland",
    "Coombe Junction Halt Devonport",
    "Devonport Dockyard Falmouth Docks",
    "Falmouth Town Gunnislake Hayle Keyham Lelant",
    "Lelant Saltings",
    "Liskeard",
    "Looe",
    "Lostwithiel",
    "Luxulyan Menheniot Newquay",
    "Par",
    "Penmere",
    "Penryn",
    "Penzance",
    "Perranwell",
    "Plymouth Quintrell Downs",
    "Roche Reduth Saltash",
    "Sandplace",
    "St Austell",
    "St Budeaux Ferry Rd",
    "St Budeaux Victoria Rd",
    "St Columb Rd",
    "St Erth",
    "St Germans",
    "St Ives",
    "St Keyne Wishing Well Halt Truro"
  ],
  "route_map_images": [
    "ticket_maps/Ride_Cornwall_rail_and_bus_day_ranger_ride_cornwall.gif"
  ]
}