{
  "name": "Sunshine Coast Line Ranger (Colchester-Walton on the Naze)",
  "url": "http://www.railrover.org/pages/sunshine-coast-line-ranger.html",
  "description": "SUNSHINE COAST LINE RANGER Unlimited travel for one day with weekday time restrictions to all stations between Colchester, Clacton-on-Sea and Walton-on-the-Naze along what is called the \"Sunshine Coast Line\".",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult: £13.10 child (5-15): £6.55 child (5-15) with adult: £2.00 16-17 saver: £6.55 family: £26.20 railcards ⯆ 16 26 SE DI 2T FF H V : £8.70 DI FF H V child fare: £2.00 Railcards ⯈ Railcards: 16 = 16-25 26 = 26-30 SE = Senior DI = Disabled 2T = Two Together FF = Family & Friends H = HM Forces V = Veterans Previous fares ⯈ Previous fares (adult): 2024 - £12.50 Family tickets are for up to 2 adults and 2 children aged 5-15 time restrictions Mon to Fri: valid from 08:45 but 2T railcard not valid until 09:30 No restrictions at weekends or bank holidays train operating companies Greater Anglia purchasing Online: X Train conductor: ✔ * Station ticket office: ✔ Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London Kings Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Alresford Clacton-on-Sea",
    "Colchester",
    "Colchester Town Frinton-on-Sea Great Bentley Hythe Kirby Cross Thorpe-le-Soken Walton-on-the-Naze",
    "Weeley",
    "Wivenhoe"
  ],
  "route_map_images": [
    "ticket_maps/Sunshine_Coast_Line_Ranger_Colchester-Walton_on_the_Naze_sunshine_coast_line_ranger.gif"
  ]
}