{
  "name": "Waterside Wanderer Day Ranger (Southampton area)",
  "url": "http://www.railrover.org/pages/waterside-wanderer-day-ranger.html",
  "description": "WATERSIDE WANDERER DAY RANGER Unlimited travel for one day with weekday time restrictions centered around Southampton and extending from Romsey in the west to Winchester in the east and Bursledon in the south. The Hythe Ferry between Hythe and Southampton Town Quay is also included as is the \"Quayconnect\" bus service between Southampton \n      Central station and Southampton Town Quay. It is also valid on \"Bluestar\" bus routes 8 & 9 between Southampton, Hythe and Fawley.",
  "fares_and_restrictions": {
    "raw": "fares & restrictions Fares correct 8th June 2025 One day ranger adult: £13.50 child (5-15): £6.75 railcards: no time restrictions Mon to Fri: valid from 09:00 but 2T railcard not valid until 09:30 and NW railcard not valid until 10:00 No restrictions at weekends or bank holidays train operating companies CrossCountry, Great Western Railway, South Western Railway route restrictions Not valid on Southern services purchasing Online : ✔ Station ticket office: ✔ Train conductor: ✔ * Ticket Vending Machine: i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London Kings Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Bitterne",
    "Bursledon Chandler's Ford Eastleigh Hamble Millbrook Netley Redbridge",
    "Romsey St Denys",
    "Shawford",
    "Sholing",
    "Southampton Airport Parkway",
    "Southampton Central",
    "Swaythling Winchester",
    "Woolston"
  ],
  "route_map_images": [
    "ticket_maps/Waterside_Wanderer_Day_Ranger_Southampton_area_waterside_wanderer.gif"
  ]
}