{
  "name": "West Midlands Daytripper (smaller West Midlands area)",
  "url": "http://www.railrover.org/pages/west-midlands-day-tripper.html",
  "description": "n-NETWORK DAYTRIPPER Unlimited travel with weekday time restrictions for one day on all trains, buses and Metro trams throughout the Network West Midlands area zones one to five. A separate adult ticket is available called the ADULT PLUS which is valid to the following stations: Stratford-upon-Avon, Kenilworth, Kidderminster, \n      Leamington Spa, Lichfield and Warwick after 09:30 and costs £10.70. NOT VALID between Coventry and Leamington Spa on Cross Country Trains. A separate adult ticket is available called the ADULT ADD-ON which is valid to the following stations: Landywood, Cannock, Hednesford, \n      Rugeley Town and Rugeley Trent Valley after 09:30 and costs £9.30. A separate adult ticket is available for peak time travel called the 1 day nnetwork Zones 1-5 valid anytime and costs £10.00 The Adult Plus and Adult Add-on tickets can only be purchased from railway stations and should be purchased with the Daytripper ticket. Note that the \"Network West Midlands\" area is NOT the same as the West Midlands Day Ranger area",
  "fares_and_restrictions": {
    "raw": "fares & restrictions New fares from 2nd Mar 2025 One day ranger adult (anytime): £11.00 adult (from 09:30): £8.80 child (5-15): £6.00 family: £15.00 railcards: no *Family tickets are for up to 6 people, not more than two of whom may be 16 or over and each group must contain at least one adult and one child (5-15) Previous fares ⯈ Previous fares (adult 09:30): 2024 - £10.50 2023 - £10.00 2022 - £7.20 2021 - £6.90 2020 - £6.90 2019 - £6.90 2018 - £6.90 2014 - £6.20 2011 - £5.50 time restrictions Mon to Fri: valid from 09:30 but \"peak\" ticket valid anytime No restrictions at weekends or bank holidays route restrictions Not valid on CrossCountry between Coventry and Leamington Spa train operating companies Avanti West Coast, Chiltern Railways, CrossCountry, London Northwestern Railway, Transport for Wales, West Midlands Railway purchasing Online: X Train conductor: X Bus driver: ✔ Metro: ✔ Station ticket office: ✔ Ticket Vending Machine: ✔ i Northern Ticket Vending Machines now sell most ranger and rover tickets but at the moment only for same-day travel (rather prohibitive for distant areas) Some Avanti West Coast station TVMs for example Crewe, now sell local rangers and rovers. LNER TVMs at Doncaster, Edinburgh, London King's Cross, Newcastle and York also sell them. A number of PTE areas sell local rangers from TVMs in their area e.g. South Yorkshire, Strathclyde and West Midlands (excludes plus and add-on tickets which can only be bought at railway stations) * valid ticket to travel is required unless boarded at a station without ticket-issuing facilities"
  },
  "stations": [
    "Acocks Green",
    "Adderley Park",
    "Aston Bedworth",
    "Berkswell",
    "Bescot Stadium",
    "Birmingham International",
    "Birmingham Moor Street",
    "Birmingham New Street",
    "Birmingham Snow Hill",
    "Blake Street",
    "Bloxwich",
    "Bloxwich North",
    "Bordesley",
    "Bournville",
    "Butlers Lane Canley",
    "Chester Road",
    "Coseley",
    "Coventry",
    "Coventry Arena",
    "Cradley Heath Dorridge",
    "Duddeston",
    "Dudley Port Earlswood",
    "Erdlington Five Ways",
    "Four Oaks Gravelly Hill Hall Green",
    "Hampton-in-Arden",
    "Hamstead Jewellery Quarter Kenilworth",
    "Kings Norton Langley Green",
    "Lea Hall",
    "Longbridge",
    "Lye Marston Green Northfield Old Hill",
    "Olton Perry Barr Rowley Regis Sandwell & Dudley",
    "Selly Oak",
    "Shirley",
    "Small Heath",
    "Smethwick Galton Bridge",
    "Smethwick Rolfe Street",
    "Solihull",
    "Spring Road",
    "Stechford",
    "Stourbridge Junction",
    "Stourbridge Town",
    "Sutton Coldfield Tame Bridge Parkway",
    "The Hawthorns",
    "Tile Hill",
    "Tipton",
    "Tyseley University Walsall",
    "Whitlocks End",
    "Widney Manor",
    "Witton",
    "Wolverhampton",
    "Wylde Green",
    "Wythall Yardley Wood"
  ],
  "route_map_images": [
    "ticket_maps/West_Midlands_Daytripper_smaller_West_Midlands_area_west_midlands_daytripper.gif"
  ]
}